sergev/pic32prog/adapter-pickit2.c
/*
 * Interface to PIC32 ICSP port using Microchip PICkit2/PICkit3 USB adapter.
 *
 * To use PICkit3, you would need to upgrade the firmware
 * using free PICkit 3 Scripting Tool from Microchip.
 *
 * Copyright (C) 2011-2013 Serge Vakulenko
 *
 * This file is part of PIC32PROG project, which is distributed
 * under the terms of the GNU General Public License (GPL).
 * See the accompanying file "COPYING" for more details.
 */
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <string.h>
#include <errno.h>

#include "adapter.h"
#include "hidlib.h"
#include "pickit2.h"
#include "pic32.h"

typedef struct {
    /* Common part */
    adapter_t adapter;
    int is_pk3;
    const char *name;

    unsigned char reply [64];
    unsigned use_executive;
    unsigned serial_execution_mode;

} pickit_adapter_t;

/*
 * Programmable power voltages.
 */
#define VDD_VOLTAGE             3.3     /* Power supply */
#define VDD_LIMIT               2.81
#define VPP_VOLTAGE             3.28    /* Reset voltage */
#define VPP_LIMIT               2.26

/*
 * Identifiers of USB adapter.
 */
#define MICROCHIP_VID           0x04d8
#define PICKIT2_PID             0x0033  /* Microchip PICkit 2 */
#define PICKIT3_PID             0x900a  /* Microchip PICkit 3 */
#define ONBOARD_PID             0x8107  /* Onboard Programmer */
#define CHIPKIT_PID             0x8108  /* chipKIT Programmer */

/*
 * USB endpoints.
 */
#define OUT_EP                  0x01
#define IN_EP                   0x81

#define IFACE                   0
#define TIMO_MSEC               1000

#define WORD_AS_BYTES(w)  (unsigned char) (w), \
                          (unsigned char) ((w) >> 8), \
                          (unsigned char) ((w) >> 16), \
                          (unsigned char) ((w) >> 24)

static void pickit_send(pickit_adapter_t *a, unsigned argc, ...)
{
    va_list ap;
    unsigned i;
    unsigned char buf [64];

    memset(buf, CMD_END_OF_BUFFER, 64);
    va_start(ap, argc);
    for (i=0; i<argc; ++i)
        buf[i] = va_arg(ap, int);
    va_end(ap);

    hid_send_recv(buf, 64, 0, 0);
}

static void pickit_send_recv(pickit_adapter_t *a, unsigned argc, ...)
{
    va_list ap;
    unsigned i;
    unsigned char buf [64];

    memset(buf, CMD_END_OF_BUFFER, 64);
    va_start(ap, argc);
    for (i=0; i<argc; ++i)
        buf[i] = va_arg(ap, int);
    va_end(ap);

    hid_send_recv(buf, 64, a->reply, 64);
}

static void check_timeout(pickit_adapter_t *a, const char *message)
{
    unsigned status;

    pickit_send_recv(a, 1, CMD_READ_STATUS);
    status = a->reply[0] | a->reply[1] << 8;
    if (status & STATUS_ICD_TIMEOUT) {
        fprintf(stderr, "%s: timed out at %s, status = %04x\n",
            a->name, message, status);
        exit(-1);
    }
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution(pickit_adapter_t *a)
{
    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    // Enter serial execution.
    if (debug_level > 0)
        fprintf(stderr, "%s: enter serial execution\n", a->name);
    pickit_send(a, 29, CMD_EXECUTE_SCRIPT, 27,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ASSERT_RST,
        SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
        SCRIPT_JT2_SETMODE, 6, 0x1F,
        SCRIPT_JT2_SENDCMD, ETAP_EJTAGBOOT,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_DEASSERT_RST,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_FLASH_ENABLE);
}

static void
step1_6_mm(pickit_adapter_t *a, unsigned nwords)
{

    if (debug_level > 0)
        fprintf(stderr, "%s: download PE loader\n", a->name);
    pickit_send(a, 20, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 8,          //----------------- step 1
            WORD_AS_BYTES(0xa00041a4),
            WORD_AS_BYTES(0x02005084),
        CMD_EXECUTE_SCRIPT, 7,         //----------------- execute
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout(a, "step1");

    // Download the PE loader
    int i;
    for (i=0; i<PIC32_PEMM_LOADER_LEN; i+=2) {
        pickit_send(a, 20, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 12,          //------------- step 5
                WORD_AS_BYTES((0x41A6
                    | pic32_pemm_loader[i+1] << 16)),
                WORD_AS_BYTES((0x50c6
                    | pic32_pemm_loader[i] << 16)),
                WORD_AS_BYTES(0x6e42eb40),
            CMD_EXECUTE_SCRIPT, 3,          //------------- execute
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF);
        check_timeout(a, "step5");
    }

    // Jump to PE loader
    pickit_send(a, 47, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 20,          //----------------- step 6
            WORD_AS_BYTES(0xa00041b9),
            WORD_AS_BYTES(0x02015339),
            WORD_AS_BYTES(0x0c004599),
            WORD_AS_BYTES(0x0c000c00),
            WORD_AS_BYTES(0x0c000c00),
        CMD_EXECUTE_SCRIPT, 22,         //----------------- execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0, 3, 0, 0xA0,                  // PE_ADDRESS = 0xA000_0300
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) nwords,         // PE_SIZE
                (unsigned char) (nwords >> 8),
                0, 0);
    check_timeout(a, "step6");
}

static void
step1_6_mz(pickit_adapter_t *a, unsigned nwords)
{

    if (debug_level > 0)
        fprintf(stderr, "%s: download PE loader\n", a->name);
    pickit_send(a, 45, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 28,          //----------------- step 1
            WORD_AS_BYTES(0x3c04bf88),  // lui a0, 0xbf88
            WORD_AS_BYTES(0x34842000),  // ori a0, 0x2000 - address of BMXCON
            WORD_AS_BYTES(0x3c05001f),  // lui a1, 0x1f
            WORD_AS_BYTES(0x34a50040),  // ori a1, 0x40   - a1 has 001f0040
            WORD_AS_BYTES(0xac850000),  // sw  a1, 0(a0)  - BMXCON initialized
                                        //----------------- step 2
            WORD_AS_BYTES(0x34050800),  // li  a1, 0x800  - a1 has 00000800
            WORD_AS_BYTES(0xac850010),  // sw  a1, 16(a0) - BMXDKPBA initialized
        CMD_EXECUTE_SCRIPT, 12,         //----------------- execute
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout(a, "step1");

    pickit_send(a, 30, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 20,          //----------------- step 3
            WORD_AS_BYTES(0x8c850040),  // lw  a1, 64(a0) - load BMXDMSZ
            WORD_AS_BYTES(0xac850020),  // sw  a1, 32(a0) - BMXDUDBA initialized
            WORD_AS_BYTES(0xac850030),  // sw  a1, 48(a0) - BMXDUPBA initialized
                                        //----------------- step 4
            WORD_AS_BYTES(0x3c04a000),  // lui a0, 0xa000
            WORD_AS_BYTES(0x34840800),  // ori a0, 0x800  - a0 has a0000800
        CMD_EXECUTE_SCRIPT, 5,          //----------------- execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout(a, "step3");

    // Download the PE loader
    int i;
    for (i=0; i<PIC32_PE_LOADER_LEN; i+=2) {
        pickit_send(a, 25, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 16,          //------------- step 5
                WORD_AS_BYTES((0x3c060000   // lui a2, PE_loader_hi++
                    | pic32_pe_loader[i])),
                WORD_AS_BYTES((0x34c60000   // ori a2, PE_loader_lo++
                    | pic32_pe_loader[i+1])),
                WORD_AS_BYTES(0xac860000),  // sw  a2, 0(a0)
                WORD_AS_BYTES(0x24840004),  // addiu a0, 4
            CMD_EXECUTE_SCRIPT, 4,          //------------- execute
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF);
        check_timeout(a, "step5");
    }

    // Jump to PE loader
    pickit_send(a, 42, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 16,          //----------------- step 6
            WORD_AS_BYTES(0x3c19a000),  // lui t9, 0xa000
            WORD_AS_BYTES(0x37390800),  // ori t9, 0x800  - t9 has a0000800
            WORD_AS_BYTES(0x03200008),  // jr  t9
            WORD_AS_BYTES(0x00000000),  // nop
        CMD_EXECUTE_SCRIPT, 21,         //----------------- execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0, 9, 0, 0xA0,                  // PE_ADDRESS = 0xA000_0900
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) nwords,         // PE_SIZE
                (unsigned char) (nwords >> 8),
                0, 0);
    check_timeout(a, "step6");
}

