sergev/pic32prog/adapter-pickit2.c
/*
 * Download programming executive (PE).
 */
static void pickit_load_executive(adapter_t *adapter,
    const unsigned *pe, unsigned nwords,
    unsigned pe_version)
{
    pickit_adapter_t *a = (pickit_adapter_t*) adapter;
    int i;

    a->name = a->adapter.family_name;
    //fprintf(stderr, "%s: load_executive\n", a->name);
    a->use_executive = 1;
    serial_execution(a);

    if (strcmp(a->name, "mm") == 0)
        step1_6_mm(a, nwords);
    else
        step1_6_mz(a, nwords);

    // Download the PE itself (step 7-B)
    if (debug_level > 0)
        fprintf(stderr, "%s: download PE code\n", a->name);
    int nloops = (nwords + 9) / 10;
    for (i=0; i<nloops; i++, pe+=10) {          // download 10 words at a time
        pickit_send(a, 55, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 40,
                WORD_AS_BYTES(pe[0]),
                WORD_AS_BYTES(pe[1]),
                WORD_AS_BYTES(pe[2]),
                WORD_AS_BYTES(pe[3]),
                WORD_AS_BYTES(pe[4]),
                WORD_AS_BYTES(pe[5]),
                WORD_AS_BYTES(pe[6]),
                WORD_AS_BYTES(pe[7]),
                WORD_AS_BYTES(pe[8]),
                WORD_AS_BYTES(pe[9]),
            CMD_EXECUTE_SCRIPT, 10,             // execute
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF);
        check_timeout(a, "step7");
    }
    mdelay(100);

    // Download the PE instructions
    pickit_send(a, 15, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 8,
            WORD_AS_BYTES(0x00000000),         // step 8 - jump to PE
            WORD_AS_BYTES(0xDEAD0000),
        CMD_EXECUTE_SCRIPT, 2,                  // execute
            SCRIPT_JT2_XFRFASTDAT_BUF,
            SCRIPT_JT2_XFRFASTDAT_BUF);
    check_timeout(a, "step8");
    mdelay(100);

    pickit_send(a, 11, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 8,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0x00, 0x00,                     // length = 0
                0x07, 0x00,                     // EXEC_VERSION
            SCRIPT_JT2_GET_PE_RESP);
    check_timeout(a, "EXEC_VERSION");
    pickit_send_recv(a, 1, CMD_UPLOAD_DATA);

    unsigned version = a->reply[3] | (a->reply[4] << 8);
    if (version != 0x0007) {                    // command echo
        fprintf(stderr, "%s: bad PE reply = %04x\n", a->name, version);
        exit(-1);
    }
    version = a->reply[1] | (a->reply[2] << 8);
    if (version != pe_version) {
        fprintf(stderr, "%s: bad PE version = %04x, expected %04x\n",
            a->name, version, pe_version);
        exit(-1);
    }
    if (debug_level > 0)
        fprintf(stderr, "%s: PE version = %04x\n", a->name, version);
}

#if 0
int pe_blank_check(pickit_adapter_t *a,
    unsigned int start, unsigned int nbytes)
{
    pickit_send(a, 21, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 18,
        SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
        SCRIPT_JT2_XFRFASTDAT_LIT,
            0x00, 0x00,
            0x06, 0x00,                         // BLANK_CHECK
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) start,
            (unsigned char) (start >> 8),
            (unsigned char) (start >> 16),
            (unsigned char) (start >> 24),
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) nbytes,
            (unsigned char) (nbytes >> 8),
            (unsigned char) (nbytes >> 16),
            (unsigned char) (nbytes >> 24),
        SCRIPT_JT2_GET_PE_RESP);
    check_timeout(a, "BLANK_CHECK");
    pickit_send_recv(a, 1, CMD_UPLOAD_DATA);
    if (a->reply[3] != 6 || a->reply[1] != 0) { // response code 0 = success
        return 0;
    }
    return 1;
}

int pe_get_crc(pickit_adapter_t *a,
    unsigned int start, unsigned int nbytes)
{
    pickit_send(a, 22, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 19,
        SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
        SCRIPT_JT2_XFRFASTDAT_LIT,
            0x00, 0x00,
            0x08, 0x00,                         // GET_CRC
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) start,
            (unsigned char) (start >> 8),
            (unsigned char) (start >> 16),
            (unsigned char) (start >> 24),
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) nbytes,
            (unsigned char) (nbytes >> 8),
            (unsigned char) (nbytes >> 16),
            (unsigned char) (nbytes >> 24),
        SCRIPT_JT2_GET_PE_RESP,
        SCRIPT_JT2_GET_PE_RESP);
    check_timeout(a, "GET_CRC");
    pickit_send_recv(a, 1, CMD_UPLOAD_DATA);
    if (a->reply[3] != 8 || a->reply[1] != 0) { // response code 0 = success
        return 0;
    }

    int crc = a->reply[5] | (a->reply[6] << 8);
    return crc;
}
#endif

static void pickit_finish(pickit_adapter_t *a, int power_on)
{
    /* Exit programming mode. */
    pickit_send(a, 18, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 15,
        SCRIPT_JT2_SETMODE, 5, 0x1f,
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_VPP_PWM_OFF,
        SCRIPT_SET_ICSP_PINS, 6,                // set PGC high, PGD input
        SCRIPT_SET_ICSP_PINS, 2,                // set PGC low, PGD input
        SCRIPT_SET_ICSP_PINS, 3,                // set PGC and PGD as input
        SCRIPT_DELAY_LONG, 10,                  // 50 msec
        SCRIPT_BUSY_LED_OFF);

    if (! power_on) {
        /* Detach power from the board. */
        pickit_send(a, 4, CMD_EXECUTE_SCRIPT, 2,
            SCRIPT_VDD_OFF,
            SCRIPT_VDD_GND_ON);
    }

    /* Disable reset. */
    pickit_send(a, 3, CMD_EXECUTE_SCRIPT, 1,
        SCRIPT_MCLR_GND_OFF);

    /* Read board status. */
    check_timeout(a, "finish");
}

static void pickit_close(adapter_t *adapter, int power_on)
{
    pickit_adapter_t *a = (pickit_adapter_t*) adapter;
    //fprintf(stderr, "%s: close\n", a->name);

    pickit_finish(a, power_on);
    free(a);
}

