sergev/pic32prog/adapter-pickit2.c
/*
 * Read the Device Identification code
 */
static unsigned pickit_get_idcode(adapter_t *adapter)
{
    pickit_adapter_t *a = (pickit_adapter_t*) adapter;
    unsigned idcode;

    /* Read device id. */
    pickit_send(a, 12, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 9,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_IDCODE,
        SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0);
    pickit_send_recv(a, 1, CMD_UPLOAD_DATA);
    //fprintf(stderr, "%s: read id, %d bytes: %02x %02x %02x %02x\n", a->name,
    //  a->reply[0], a->reply[1], a->reply[2], a->reply[3], a->reply[4]);
    if (a->reply[0] != 4)
        return 0;
    idcode = a->reply[1] | a->reply[2] << 8 | a->reply[3] << 16 | a->reply[4] << 24;
    return idcode;
}

/*
 * Read a word from memory (without PE).
 */
static unsigned pickit_read_word(adapter_t *adapter, unsigned addr)
{
    pickit_adapter_t *a = (pickit_adapter_t*) adapter;
    serial_execution(a);

    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;
    pickit_send(a, 49, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_CLEAR_UPLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 24,
            WORD_AS_BYTES(0x3c13ff20),              // lui s3, 0xFF20
            WORD_AS_BYTES(0x3c080000 | addr_hi),    // lui t0, addr_hi
            WORD_AS_BYTES(0x35080000 | addr_lo),    // ori t0, addr_lo
            WORD_AS_BYTES(0x8d090000),              // lw t1, 0(t0)
            WORD_AS_BYTES(0xae690000),              // sw t1, 0(s3)
            WORD_AS_BYTES(0),                       // nop
        CMD_EXECUTE_SCRIPT, 18,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,      // read FastData
            SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0,
        CMD_UPLOAD_DATA);
    if (a->reply[0] != 4) {
        fprintf(stderr, "%s: read word %08x: bad reply length=%u\n",
            a->name, addr, a->reply[0]);
        exit(-1);
    }
    unsigned word1 = a->reply[1] | (a->reply[2] << 8) |
           (a->reply[3] << 16) | (a->reply[4] << 24);

    pickit_send(a, 54, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_CLEAR_UPLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 28,
            WORD_AS_BYTES(0x3c13ff20),              // lui s3, 0xFF20
            WORD_AS_BYTES(0x3c080000 | addr_hi),    // lui t0, addr_hi
            WORD_AS_BYTES(0x35080000 | addr_lo),    // ori t0, addr_lo
            WORD_AS_BYTES(0x8d090000),              // lw t1, 0(t0)
            WORD_AS_BYTES(0x00094842),              // srl t1, 1
            WORD_AS_BYTES(0xae690004),              // sw t1, 4(s3)
            WORD_AS_BYTES(0),                       // nop
        CMD_EXECUTE_SCRIPT, 19,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,      // read FastData
            SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0,
        CMD_UPLOAD_DATA);
    if (a->reply[0] != 4) {
        fprintf(stderr, "%s: read word %08x: bad reply length=%u\n",
            a->name, addr, a->reply[0]);
        exit(-1);
    }
    unsigned word2 = a->reply[1] | (a->reply[2] << 8) |
           (a->reply[3] << 16) | (a->reply[4] << 24);

    /* First word of reply contains 31 bits of value in MSB; LSB bit is garbage.
     * Second word contains the MSB bit of the value. */
    unsigned value = (word1 >> 1) | (word2 & 0x80000000);
    if (debug_level > 0)
        fprintf(stderr, "%s: %08x -> %08x\n", __func__, addr, value);
    return value;
}

/*
 * Read a block of memory, multiple of 1 kbyte.
 */
static void pickit_read_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    pickit_adapter_t *a = (pickit_adapter_t*) adapter;
    unsigned char buf [64];
    unsigned words_read;

//fprintf(stderr, "%s: read %d bytes from %08x\n", a->name, nwords*4, addr);
    if (! a->use_executive) {
        /* Without PE. */
        for (; nwords > 0; nwords--) {
            *data++ = pickit_read_word(adapter, addr);
            addr += 4;
        }
        return;
    }

    /* Use PE to read memory. */
    for (words_read = 0; words_read < nwords; ) {
        /* Download addresses for 8 script runs. */
        unsigned i, k = 0;
        memset(buf, CMD_END_OF_BUFFER, 64);
        buf[k++] = CMD_CLEAR_DOWNLOAD_BUFFER;
        buf[k++] = CMD_DOWNLOAD_DATA;
        buf[k++] = 8 * 4;
        for (i = 0; i < 8; i++) {
            unsigned address = addr + words_read*4 + i*32*4;
            buf[k++] = address;
            buf[k++] = address >> 8;
            buf[k++] = address >> 16;
            buf[k++] = address >> 24;
        }

        hid_send_recv(buf, k, 0, 0);

        for (k = 0; k < 8; k++) {
            /* Read progmem. */
            pickit_send_recv(a, 17, CMD_CLEAR_UPLOAD_BUFFER,
                CMD_EXECUTE_SCRIPT, 13,
                    SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
                    SCRIPT_JT2_XFRFASTDAT_LIT,
                        0x20, 0, 1, 0,          // READ
                    SCRIPT_JT2_XFRFASTDAT_BUF,
                    SCRIPT_JT2_WAIT_PE_RESP,
                    SCRIPT_JT2_GET_PE_RESP,
                    SCRIPT_LOOP, 1, 31,
                CMD_UPLOAD_DATA_NOLEN);
            memcpy(data, a->reply, 64);
//fprintf(stderr, "   ...%08x...\n", data[0]);
            data += 64/4;
            words_read += 64/4;

            /* Get second half of upload buffer. */
            pickit_send_recv(a, 1, CMD_UPLOAD_DATA_NOLEN);
            memcpy(data, a->reply, 64);
            data += 64/4;
            words_read += 64/4;
        }
    }
}

