sergev/pic32prog/adapter-pickit2.c
    /* Enter programming mode. */
    pickit_send(a, 42, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 39,
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_VPP_PWM_ON,
        SCRIPT_BUSY_LED_ON,
        SCRIPT_SET_ICSP_PINS, 0,                // set PGC and PGD output low
        SCRIPT_DELAY_LONG, 20,                  // 100 msec
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_SHORT, 23,                 // 1 msec
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_DELAY_SHORT, 47,                 // 2 msec
        SCRIPT_WRITE_BYTE_LITERAL, 0xb2,        // magic word
        SCRIPT_WRITE_BYTE_LITERAL, 0xc2,
        SCRIPT_WRITE_BYTE_LITERAL, 0x12,
        SCRIPT_WRITE_BYTE_LITERAL, 0x0a,
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_LONG, 2,                   // 10 msec
        SCRIPT_SET_ICSP_PINS, 2,                // set PGC low, PGD input
        SCRIPT_JT2_SETMODE, 6, 0x1f,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS);
    pickit_send_recv(a, 1, CMD_UPLOAD_DATA);
    if (debug_level > 1)
        fprintf(stderr, "%s: got %02x-%02x\n", a->name, a->reply[0], a->reply[1]);
    if (a->reply[0] != 1) {
        fprintf(stderr, "%s: cannot get MCHP STATUS\n", a->name);
        pickit_finish(a, 0);
        return 0;
    }
    if (! (a->reply[1] & MCHP_STATUS_CFGRDY)) {
        fprintf(stderr, "No device attached.\n");
        pickit_finish(a, 0);
        return 0;
    }

    a->adapter.block_override = 0;
    a->adapter.flags = (AD_PROBE | AD_ERASE | AD_READ | AD_WRITE);

    if (! (a->reply[1] & MCHP_STATUS_CPS)) {
        fprintf(stderr, "%s: Device is code protected.\n", a->name);
        a->adapter.flags = (AD_ERASE);
    }

    /* User functions. */
    a->adapter.close = pickit_close;
    a->adapter.get_idcode = pickit_get_idcode;
    a->adapter.load_executive = pickit_load_executive;
    a->adapter.read_word = pickit_read_word;
    a->adapter.read_data = pickit_read_data;
    a->adapter.erase_chip = pickit_erase_chip;
    a->adapter.program_word = pickit_program_word;
    a->adapter.program_double_word = pickit_program_double_word;
    a->adapter.program_row = pickit_program_row;
    a->adapter.program_quad_word = pickit_program_quad_word;
    return &a->adapter;
}

/*
 * Initialize PICkit2 adapter.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 */
adapter_t *adapter_open_pickit2(int vid, int pid, const char *serial)
{
    int status;

#if 0
    //TODO: Use serial number to select a HID device.
    wchar_t *serialp = 0;
    if (serial) {
        wchar_t buf[256];
        mbstowcs(buf, serial, 256);
        serialp = buf;
    }
#endif
    if (vid) {
        status = hid_init(vid, pid);
    } else {
        status = hid_init(MICROCHIP_VID, PICKIT2_PID);
    }
    if (status < 0) {
        if (vid)
            fprintf(stderr, "PICkit2 not found: vid=%04x, pid=%04x, serial=%s\n",
                vid, pid, serial ? : "(none)");
        return 0;
    }
    return open_pickit(0);
}

/*
 * Initialize PICkit3 adapter.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 */
adapter_t *adapter_open_pickit3(int vid, int pid, const char *serial)
{
    int status;

#if 0
    //TODO: Use serial number to select a HID device.
    wchar_t *serialp = 0;
    if (serial) {
        wchar_t buf[256];
        mbstowcs(buf, serial, 256);
        serialp = buf;
    }
#endif
    if (vid) {
        status = hid_init(vid, pid);
    } else {
        status = hid_init(MICROCHIP_VID, PICKIT3_PID);
        if (status < 0)
            status = hid_init(MICROCHIP_VID, CHIPKIT_PID);
        if (status < 0)
            status = hid_init(MICROCHIP_VID, ONBOARD_PID);
    }
    if (status < 0) {
        if (vid)
            fprintf(stderr, "PICkit3 not found: vid=%04x, pid=%04x, serial=%s\n",
                vid, pid, serial ? : "(none)");
        return 0;
    }
    return open_pickit(1);
}
